redis_test_for_auto_numa_problem/redis_test_result_L_OFF_120G_2nd/memtier_benchmark_L_OFF_120G_2nd_Sequential110_P3_20230625041519.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       147617.98          ---          ---        19.69400        19.71100        23.67900        27.00700    314409.00 
Gets        14761.75     14761.75         0.00        19.74531        19.71100        24.31900        27.64700     31368.71 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     162379.73     14761.75         0.00        19.69866        19.71100        23.80700        27.13500    345777.72 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.439        0.000
SET      16.255        5.000
SET      18.431       10.000
SET      18.687       15.000
SET      18.815       20.000
SET      18.943       25.000
SET      19.199       30.000
SET      19.327       35.000
SET      19.455       40.000
SET      19.583       45.000
SET      19.711       50.000
SET      19.839       52.500
SET      19.839       55.000
SET      19.967       57.500
SET      19.967       60.000
SET      20.095       62.500
SET      20.223       65.000
SET      20.223       67.500
SET      20.351       70.000
SET      20.479       72.500
SET      20.607       75.000
SET      20.607       76.250
SET      20.607       77.500
SET      20.735       78.750
SET      20.735       80.000
SET      20.863       81.250
SET      20.863       82.500
SET      20.991       83.750
SET      21.119       85.000
SET      21.247       86.250
SET      21.247       87.500
SET      21.375       88.125
SET      21.375       88.750
SET      21.503       89.375
SET      21.503       90.000
SET      21.631       90.625
SET      21.631       91.250
SET      21.759       91.875
SET      21.887       92.500
SET      21.887       93.125
SET      22.015       93.750
SET      22.015       94.062
SET      22.143       94.375
SET      22.143       94.688
SET      22.143       95.000
SET      22.271       95.312
SET      22.271       95.625
SET      22.399       95.938
SET      22.399       96.250
SET      22.527       96.562
SET      22.655       96.875
SET      22.655       97.031
SET      22.655       97.188
SET      22.783       97.344
SET      22.783       97.500
SET      22.911       97.656
SET      22.911       97.812
SET      23.039       97.969
SET      23.039       98.125
SET      23.167       98.281
SET      23.295       98.438
SET      23.295       98.516
SET      23.423       98.594
SET      23.423       98.672
SET      23.423       98.750
SET      23.551       98.828
SET      23.679       98.906
SET      23.679       98.984
SET      23.807       99.062
SET      23.935       99.141
SET      24.063       99.219
SET      24.063       99.258
SET      24.191       99.297
SET      24.319       99.336
SET      24.319       99.375
SET      24.447       99.414
SET      24.575       99.453
SET      24.575       99.492
SET      24.703       99.531
SET      24.831       99.570
SET      24.959       99.609
SET      25.087       99.629
SET      25.215       99.648
SET      25.215       99.668
SET      25.343       99.688
SET      25.471       99.707
SET      25.471       99.727
SET      25.599       99.746
SET      25.727       99.766
SET      25.855       99.785
SET      25.983       99.805
SET      25.983       99.814
SET      26.111       99.824
SET      26.239       99.834
SET      26.239       99.844
SET      26.367       99.854
SET      26.495       99.863
SET      26.623       99.873
SET      26.751       99.883
SET      26.879       99.893
SET      27.007       99.902
SET      27.135       99.907
SET      27.263       99.912
SET      27.391       99.917
SET      27.391       99.922
SET      27.519       99.927
SET      27.647       99.932
SET      27.775       99.937
SET      27.903       99.941
SET      28.031       99.946
SET      28.159       99.951
SET      28.287       99.954
SET      28.415       99.956
SET      28.543       99.958
SET      28.671       99.961
SET      28.927       99.963
SET      29.183       99.966
SET      29.439       99.968
SET      30.079       99.971
SET      31.359       99.973
SET      33.279       99.976
SET     173.055       99.977
SET     179.199       99.978
SET     180.223       99.979
SET     182.271       99.980
SET     188.415       99.982
SET     204.799       99.983
SET     210.943       99.984
SET     211.967       99.985
SET     212.991       99.987
SET     215.039       99.988
SET     215.039       99.988
SET     216.063       99.989
SET     218.111       99.990
SET     218.111       99.990
SET     219.135       99.991
SET     221.183       99.991
SET     221.183       99.992
SET     221.183       99.993
SET     222.207       99.993
SET     222.207       99.994
SET     222.207       99.994
SET     223.231       99.995
SET     224.255       99.995
SET     226.303       99.995
SET     226.303       99.995
SET     303.103       99.996
SET     305.151       99.996
SET     305.151       99.996
SET     305.151       99.997
SET     311.295       99.997
SET     311.295       99.997
SET     311.295       99.997
[...]
SET     311.295       99.998
SET     311.295       99.998
SET     311.295       99.998
SET     313.343       99.998
SET     313.343       99.998
SET     313.343       99.998
[...]
SET     313.343       99.999
SET     313.343       99.999
SET     313.343       99.999
[...]
SET     315.391       99.999
SET     315.391       99.999
SET     315.391       99.999
[...]
SET     315.391      100.000
SET     315.391      100.000
SET     315.391      100.000
[...]
SET     317.439      100.000
SET     317.439      100.000
SET     317.439      100.000
[...]
SET     319.487      100.000
SET     319.487      100.000
SET     319.487      100.000
[...]
SET     321.535      100.000
SET     321.535      100.000
---
GET       1.127        0.000
GET      17.023        5.000
GET      18.431       10.000
GET      18.687       15.000
GET      18.815       20.000
GET      19.071       25.000
GET      19.199       30.000
GET      19.327       35.000
GET      19.455       40.000
GET      19.583       45.000
GET      19.711       50.000
GET      19.839       52.500
GET      19.839       55.000
GET      19.967       57.500
GET      20.095       60.000
GET      20.095       62.500
GET      20.223       65.000
GET      20.223       67.500
GET      20.351       70.000
GET      20.479       72.500
GET      20.607       75.000
GET      20.607       76.250
GET      20.735       77.500
GET      20.735       78.750
GET      20.863       80.000
GET      20.863       81.250
GET      20.991       82.500
GET      20.991       83.750
GET      21.119       85.000
GET      21.247       86.250
GET      21.375       87.500
GET      21.375       88.125
GET      21.503       88.750
GET      21.503       89.375
GET      21.631       90.000
GET      21.631       90.625
GET      21.759       91.250
GET      21.887       91.875
GET      21.887       92.500
GET      22.015       93.125
GET      22.143       93.750
GET      22.143       94.062
GET      22.143       94.375
GET      22.271       94.688
GET      22.271       95.000
GET      22.399       95.312
GET      22.399       95.625
GET      22.527       95.938
GET      22.655       96.250
GET      22.655       96.562
GET      22.783       96.875
GET      22.911       97.031
GET      22.911       97.188
GET      22.911       97.344
GET      23.039       97.500
GET      23.167       97.656
GET      23.167       97.812
GET      23.295       97.969
GET      23.423       98.125
GET      23.551       98.281
GET      23.679       98.438
GET      23.807       98.516
GET      23.807       98.594
GET      23.935       98.672
GET      24.063       98.750
GET      24.063       98.828
GET      24.191       98.906
GET      24.319       98.984
GET      24.447       99.062
GET      24.575       99.141
GET      24.703       99.219
GET      24.831       99.258
GET      24.831       99.297
GET      24.959       99.336
GET      25.087       99.375
GET      25.087       99.414
GET      25.215       99.453
GET      25.343       99.492
GET      25.471       99.531
GET      25.599       99.570
GET      25.727       99.609
GET      25.727       99.629
GET      25.855       99.648
GET      25.855       99.668
GET      25.983       99.688
GET      26.111       99.707
GET      26.239       99.727
GET      26.367       99.746
GET      26.367       99.766
GET      26.623       99.785
GET      26.751       99.805
GET      26.751       99.814
GET      26.879       99.824
GET      27.007       99.834
GET      27.007       99.844
GET      27.135       99.854
GET      27.263       99.863
GET      27.391       99.873
GET      27.519       99.883
GET      27.519       99.893
GET      27.647       99.902
GET      27.775       99.907
GET      27.775       99.912
GET      27.903       99.917
GET      28.031       99.922
GET      28.031       99.927
GET      28.159       99.932
GET      28.287       99.937
GET      28.415       99.941
GET      28.543       99.946
GET      28.671       99.951
GET      28.799       99.954
GET      28.927       99.956
GET      29.055       99.958
GET      29.183       99.961
GET      29.311       99.963
GET      29.439       99.966
GET      29.695       99.968
GET      30.207       99.971
GET      31.231       99.973
GET      33.279       99.976
GET     173.055       99.977
GET     179.199       99.978
GET     180.223       99.979
GET     182.271       99.980
GET     188.415       99.982
GET     204.799       99.983
GET     210.943       99.984
GET     211.967       99.985
GET     212.991       99.987
GET     215.039       99.988
GET     216.063       99.988
GET     218.111       99.989
GET     218.111       99.990
GET     219.135       99.990
GET     219.135       99.991
GET     221.183       99.991
GET     221.183       99.992
GET     222.207       99.993
GET     222.207       99.993
GET     222.207       99.994
GET     224.255       99.994
GET     224.255       99.995
GET     226.303       99.995
GET     226.303       99.995
GET     227.327       99.995
GET     305.151       99.996
GET     305.151       99.996
GET     305.151       99.996
GET     311.295       99.997
GET     311.295       99.997
GET     311.295       99.997
[...]
GET     311.295       99.998
GET     311.295       99.998
GET     313.343       99.998
GET     313.343       99.998
GET     313.343       99.998
[...]
GET     313.343       99.999
GET     313.343       99.999
GET     313.343       99.999
[...]
GET     315.391       99.999
GET     315.391       99.999
GET     315.391       99.999
[...]
GET     315.391      100.000
GET     315.391      100.000
GET     315.391      100.000
[...]
GET     319.487      100.000
GET     319.487      100.000
---
WAIT      0.000      100.000